; domain
(define (domain ferry)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l6-c8)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 
          c0 c1 c2 c3 c4 c5 c6 c7 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(car c5)
(car c6)
(car c7)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(empty-ferry)
(at c0 l1)
(at c1 l5)
(at c2 l0)
(at c3 l0)
(at c4 l2)
(at c5 l4)
(at c6 l2)
(at c7 l3)
(at-ferry l4)
)
(:goal
(and
(at c0 l3)
(at c1 l1)
(at c2 l0)
(at c3 l2)
(at c4 l0)
(at c5 l0)
(at c6 l4)
(at c7 l2)
)
)
)

; plan
1. (board c5 l4)
   deleted: (at c5 l4) (empty-ferry)
   added: (on c5)
   goals met: 1 of 8
2. (sail l4 l0)
   deleted: (at-ferry l4)
   added: (at-ferry l0)
   goals met: 1 of 8
3. (debark c5 l0)
   deleted: (on c5)
   added: (at c5 l0) (empty-ferry)
   goals met: 2 of 8
4. (board c3 l0)
   deleted: (at c3 l0) (empty-ferry)
   added: (on c3)
   goals met: 2 of 8
5. (sail l0 l2)
   deleted: (at-ferry l0)
   added: (at-ferry l2)
   goals met: 2 of 8
6. (debark c3 l2)
   deleted: (on c3)
   added: (at c3 l2) (empty-ferry)
   goals met: 3 of 8
7. (board c4 l2)
   deleted: (at c4 l2) (empty-ferry)
   added: (on c4)
   goals met: 3 of 8
8. (sail l2 l0)
   deleted: (at-ferry l2)
   added: (at-ferry l0)
   goals met: 3 of 8
9. (debark c4 l0)
   deleted: (on c4)
   added: (at c4 l0) (empty-ferry)
   goals met: 4 of 8
10. (sail l0 l5)
   deleted: (at-ferry l0)
   added: (at-ferry l5)
   goals met: 4 of 8
11. (board c1 l5)
   deleted: (at c1 l5) (empty-ferry)
   added: (on c1)
   goals met: 4 of 8
12. (sail l5 l1)
   deleted: (at-ferry l5)
   added: (at-ferry l1)
   goals met: 4 of 8
13. (debark c1 l1)
   deleted: (on c1)
   added: (at c1 l1) (empty-ferry)
   goals met: 5 of 8
14. (board c0 l1)
   deleted: (at c0 l1) (empty-ferry)
   added: (on c0)
   goals met: 5 of 8
15. (sail l1 l3)
   deleted: (at-ferry l1)
   added: (at-ferry l3)
   goals met: 5 of 8
16. (debark c0 l3)
   deleted: (on c0)
   added: (at c0 l3) (empty-ferry)
   goals met: 6 of 8
17. (board c7 l3)
   deleted: (at c7 l3) (empty-ferry)
   added: (on c7)
   goals met: 6 of 8
18. (sail l3 l2)
   deleted: (at-ferry l3)
   added: (at-ferry l2)
   goals met: 6 of 8
19. (debark c7 l2)
   deleted: (on c7)
   added: (at c7 l2) (empty-ferry)
   goals met: 7 of 8
20. (board c6 l2)
   deleted: (at c6 l2) (empty-ferry)
   added: (on c6)
   goals met: 7 of 8
21. (sail l2 l4)
   deleted: (at-ferry l2)
   added: (at-ferry l4)
   goals met: 7 of 8
22. (debark c6 l4)
   deleted: (on c6)
   added: (at c6 l4) (empty-ferry)
   goals met: 8 of 8
